pyocd/pyOCD/pyocd/debug/svd/data/LPC54608.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>LPC54S60x/LPC5460x EEPROM controller</description>
      <groupName>EEPROM</groupName>
      <baseAddress>0x40014000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFF0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EEPROM</name>
        <value>52</value>
      </interrupt>
      <registers>
        <register>
          <name>CMD</name>
          <description>EEPROM command register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWSTATE</name>
          <description>EEPROM read wait state register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE07</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RPHASE2</name>
              <description>Wait states 2 (minus 1 encoded).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPHASE1</name>
              <description>Wait states 1 (minus 1 encoded).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOPROG</name>
          <description>EEPROM auto programming register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>AUTOPROG</name>
              <description>Auto programming mode: 00 = auto programming off 01 = erase/program cycle is triggered after 1 word is written 10 = erase/program cycle is triggered after a write to AHB address ending with .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WSTATE</name>
          <description>EEPROM wait state register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40802</resetValue>
          <resetMask>0x80FFFFFF</resetMask>
          <fields>
            <field>
              <name>PHASE3</name>
              <description>Wait states for phase 3 (minus 1 encoded).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASE2</name>
              <description>Wait states for phase 2 (minus 1 encoded).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASE1</name>
              <description>Wait states for phase 1 (minus 1 encoded).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK_PARWEP</name>
              <description>Lock timing parameters for write, erase and program operation 0 = WSTATE and CLKDIV registers have R/W access 1 = WSTATE and CLKDIV registers have R only access.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <description>EEPROM clock divider register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x63</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Division factor (minus 1 encoded).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRDWN</name>
          <description>EEPROM power-down register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWRDWN</name>
              <description>Power down mode bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>EEPROM interrupt enable clear</description>
          <addressOffset>0xFD8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>PROG_CLR_EN</name>
              <description>Clear program operation finished interrupt enable bit for EEPROM.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>EEPROM interrupt enable set</description>
          <addressOffset>0xFDC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>PROG_SET_EN</name>
              <description>Set program operation finished interrupt enable bit for EEPROM device 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>EEPROM interrupt status</description>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>END_OF_PROG</name>
              <description>EEPROM program operation finished interrupt status bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>EEPROM interrupt enable</description>
          <addressOffset>0xFE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>EE_PROG_DONE</name>
              <description>EEPROM program operation finished interrupt enable bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTATCLR</name>
          <description>EEPROM interrupt status clear</description>
          <addressOffset>0xFE8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>PROG_CLR_ST</name>
              <description>Clear program operation finished interrupt status bit for EEPROM device.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTATSET</name>
          <description>EEPROM interrupt status set</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>PROG_SET_ST</name>
              <description>Set program operation finished interrupt status bit for EEPROM device.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
